apache/nuttx/arch/arm/src/kinetis/hardware/kinetis_k66pinmux.h
#define PIN_I2C2_SCL_1            (PIN_ALT5_OPENDRAIN | PIN_PORTA | PIN12)
#define PIN_I2C2_SCL_2            (PIN_ALT5_OPENDRAIN | PIN_PORTA | PIN14)
#define PIN_I2C2_SDA_1            (PIN_ALT5_OPENDRAIN | PIN_PORTA | PIN11)
#define PIN_I2C2_SDA_2            (PIN_ALT5_OPENDRAIN | PIN_PORTA | PIN13)

#define PIN_I2C3_SCL_1            (PIN_ALT2_OPENDRAIN | PIN_PORTE | PIN11)
#define PIN_I2C3_SCL_2            (PIN_ALT4_OPENDRAIN | PIN_PORTA | PIN2)
#define PIN_I2C3_SDA_1            (PIN_ALT2_OPENDRAIN | PIN_PORTE | PIN10)
#define PIN_I2C3_SDA_2            (PIN_ALT4_OPENDRAIN | PIN_PORTA | PIN1)

/* I2S */

#define PIN_I2S0_MCLK_1           (PIN_ALT4   | PIN_PORTC | PIN8)
#define PIN_I2S0_MCLK_2           (PIN_ALT4   | PIN_PORTE | PIN6)
#define PIN_I2S0_MCLK_3           (PIN_ALT6   | PIN_PORTA | PIN17)
#define PIN_I2S0_MCLK_4           (PIN_ALT6   | PIN_PORTC | PIN6)
#define PIN_I2S0_RX_BCLK_1        (PIN_ALT4   | PIN_PORTC | PIN6)
#define PIN_I2S0_RX_BCLK_2        (PIN_ALT4   | PIN_PORTC | PIN9)
#define PIN_I2S0_RX_BCLK_3        (PIN_ALT4   | PIN_PORTE | PIN9)
#define PIN_I2S0_RX_BCLK_4        (PIN_ALT6   | PIN_PORTA | PIN14)
#define PIN_I2S0_RX_FS_1          (PIN_ALT4   | PIN_PORTC | PIN10)
#define PIN_I2S0_RX_FS_2          (PIN_ALT4   | PIN_PORTC | PIN7)
#define PIN_I2S0_RX_FS_3          (PIN_ALT4   | PIN_PORTE | PIN8)
#define PIN_I2S0_RX_FS_4          (PIN_ALT6   | PIN_PORTA | PIN16)
#define PIN_I2S0_RXD0_1           (PIN_ALT4   | PIN_PORTC | PIN5)
#define PIN_I2S0_RXD0_2           (PIN_ALT4   | PIN_PORTE | PIN7)
#define PIN_I2S0_RXD0_3           (PIN_ALT6   | PIN_PORTA | PIN15)
#define PIN_I2S0_RXD1_1           (PIN_ALT2   | PIN_PORTE | PIN8)
#define PIN_I2S0_RXD1_2           (PIN_ALT4   | PIN_PORTC | PIN11)
#define PIN_I2S0_RXD1_3           (PIN_ALT7   | PIN_PORTA | PIN16)
#define PIN_I2S0_TX_BCLK_1        (PIN_ALT4   | PIN_PORTB | PIN18)
#define PIN_I2S0_TX_BCLK_2        (PIN_ALT4   | PIN_PORTE | PIN12)
#define PIN_I2S0_TX_BCLK_3        (PIN_ALT6   | PIN_PORTA | PIN5)
#define PIN_I2S0_TX_BCLK_4        (PIN_ALT6   | PIN_PORTC | PIN3)
#define PIN_I2S0_TX_FS_1          (PIN_ALT4   | PIN_PORTB | PIN19)
#define PIN_I2S0_TX_FS_2          (PIN_ALT4   | PIN_PORTE | PIN11)
#define PIN_I2S0_TX_FS_3          (PIN_ALT6   | PIN_PORTA | PIN13)
#define PIN_I2S0_TX_FS_4          (PIN_ALT6   | PIN_PORTC | PIN2)
#define PIN_I2S0_TXD0_1           (PIN_ALT4   | PIN_PORTE | PIN10)
#define PIN_I2S0_TXD0_2           (PIN_ALT6   | PIN_PORTA | PIN12)
#define PIN_I2S0_TXD0_3           (PIN_ALT6   | PIN_PORTC | PIN1)
#define PIN_I2S0_TXD1_1           (PIN_ALT2   | PIN_PORTE | PIN9)
#define PIN_I2S0_TXD1_2           (PIN_ALT6   | PIN_PORTC | PIN0)
#define PIN_I2S0_TXD1_3           (PIN_ALT7   | PIN_PORTA | PIN14)

/* JTAG */

#define PIN_JTAG_TCLK             (PIN_ALT7   | PIN_PORTA | PIN0)
#define PIN_JTAG_TDI              (PIN_ALT7   | PIN_PORTA | PIN1)
#define PIN_JTAG_TDO              (PIN_ALT7   | PIN_PORTA | PIN2)
#define PIN_JTAG_TMS              (PIN_ALT7   | PIN_PORTA | PIN3)
#define PIN_JTAG_TRST             (PIN_ALT7   | PIN_PORTA | PIN5)

/* Low-leakage wakeup module (LLWU, actually GPIO configurations) */

#define PIN_LLWU_P0               (PIN_ALT1   | PIN_PORTE | PIN1)
#define PIN_LLWU_P1               (PIN_ALT1   | PIN_PORTE | PIN2)
#define PIN_LLWU_P2               (PIN_ALT1   | PIN_PORTE | PIN4)
#define PIN_LLWU_P3               (PIN_ALT1   | PIN_PORTA | PIN4)
#define PIN_LLWU_P4               (PIN_ALT1   | PIN_PORTA | PIN13)
#define PIN_LLWU_P5               (PIN_ALT1   | PIN_PORTB | PIN0)
#define PIN_LLWU_P6               (PIN_ALT1   | PIN_PORTC | PIN1)
#define PIN_LLWU_P7               (PIN_ALT1   | PIN_PORTC | PIN3)
#define PIN_LLWU_P8               (PIN_ALT1   | PIN_PORTC | PIN4)
#define PIN_LLWU_P9               (PIN_ALT1   | PIN_PORTC | PIN5)
#define PIN_LLWU_P10              (PIN_ALT1   | PIN_PORTC | PIN6)
#define PIN_LLWU_P11              (PIN_ALT1   | PIN_PORTC | PIN11)
#define PIN_LLWU_P12              (PIN_ALT1   | PIN_PORTD | PIN0)
#define PIN_LLWU_P13              (PIN_ALT1   | PIN_PORTD | PIN2)
#define PIN_LLWU_P14              (PIN_ALT1   | PIN_PORTD | PIN4)
#define PIN_LLWU_P15              (PIN_ALT1   | PIN_PORTD | PIN6)
#define PIN_LLWU_P16              (PIN_ALT1   | PIN_PORTE | PIN6)
#define PIN_LLWU_P17              (PIN_ALT1   | PIN_PORTE | PIN9)
#define PIN_LLWU_P18              (PIN_ALT1   | PIN_PORTE | PIN10)
#define PIN_LLWU_P21              (PIN_ALT1   | PIN_PORTE | PIN25)
#define PIN_LLWU_P22              (PIN_ALT1   | PIN_PORTA | PIN10)
#define PIN_LLWU_P23              (PIN_ALT1   | PIN_PORTA | PIN11)
#define PIN_LLWU_P24              (PIN_ALT1   | PIN_PORTD | PIN8)
#define PIN_LLWU_P25              (PIN_ALT1   | PIN_PORTD | PIN11)

/* Low-Power Timer (LPTMR) */

#define PIN_LPTMR0_ALT1           (PIN_ALT6   | PIN_PORTA | PIN19)
#define PIN_LPTMR0_ALT2           (PIN_ALT3   | PIN_PORTC | PIN5)

/* MII */

#define PIN_MII0_COL              (PIN_ALT4   | PIN_PORTA | PIN29)
#define PIN_MII0_CRS              (PIN_ALT4   | PIN_PORTA | PIN27)
#define PIN_MII0_MDC_1            (PIN_ALT4   | PIN_PORTB | PIN1)
#define PIN_MII0_MDC_2            (PIN_ALT5   | PIN_PORTA | PIN8)
#ifdef CONFIG_KINETIS_ENET_MDIOPULLUP
#  define PIN_MII0_MDIO_1         (PIN_ALT4_PULLUP | PIN_PORTB | PIN0)
#  define PIN_MII0_MDIO_2         (PIN_ALT5_PULLUP | PIN_PORTA | PIN7)
#else
#  define PIN_MII0_MDIO_1         (PIN_ALT4   | PIN_PORTB | PIN0)
#  define PIN_MII0_MDIO_2         (PIN_ALT5   | PIN_PORTA | PIN7)
#endif
#define PIN_MII0_RXCLK            (PIN_ALT4   | PIN_PORTA | PIN11)
#define PIN_MII0_RXD0             (PIN_ALT4   | PIN_PORTA | PIN13)
#define PIN_MII0_RXD1             (PIN_ALT4   | PIN_PORTA | PIN12)
#define PIN_MII0_RXD2             (PIN_ALT4   | PIN_PORTA | PIN10)
#define PIN_MII0_RXD3             (PIN_ALT4   | PIN_PORTA | PIN9)
#define PIN_MII0_RXDV             (PIN_ALT4   | PIN_PORTA | PIN14)
#ifdef CONFIG_KINETIS_ENET_NORXER
#  define PIN_MII0_RXER           (GPIO_PULLDOWN | PIN_PORTA | PIN5)
#else
#  define PIN_MII0_RXER           (PIN_ALT4   | PIN_PORTA | PIN5)
#endif
#define PIN_MII0_TXCLK            (PIN_ALT4   | PIN_PORTA | PIN25)
#define PIN_MII0_TXD0             (PIN_ALT4   | PIN_PORTA | PIN16)
#define PIN_MII0_TXD1             (PIN_ALT4   | PIN_PORTA | PIN17)
#define PIN_MII0_TXD2             (PIN_ALT4   | PIN_PORTA | PIN24)
#define PIN_MII0_TXD3             (PIN_ALT4   | PIN_PORTA | PIN26)
#define PIN_MII0_TXEN             (PIN_ALT4   | PIN_PORTA | PIN15)
#define PIN_MII0_TXER             (PIN_ALT4   | PIN_PORTA | PIN28)

