apache/nuttx/arch/arm/src/kinetis/hardware/kinetis_k66pinmux.h
/* NMI */

#define PIN_NMI                   (PIN_ALT7   | PIN_PORTA | PIN4)

/* Programmable Delay Block (PDB) */

#define PIN_PDB0_EXTRG_1          (PIN_ALT3   | PIN_PORTC | PIN0)
#define PIN_PDB0_EXTRG_2          (PIN_ALT3   | PIN_PORTC | PIN6)

/* RMII */

#define PIN_RMII0_CRS_DV          (PIN_ALT4   | PIN_PORTA | PIN14)
#define PIN_RMII0_MDC_1           (PIN_ALT4   | PIN_PORTB | PIN1)
#define PIN_RMII0_MDC_2           (PIN_ALT5   | PIN_PORTA | PIN8)
#ifdef CONFIG_KINETIS_ENET_MDIOPULLUP
#  define PIN_RMII0_MDIO_1        (PIN_ALT4_PULLUP | PIN_PORTB | PIN0)
#  define PIN_RMII0_MDIO_2        (PIN_ALT5_PULLUP | PIN_PORTA | PIN7)
#else
#  define PIN_RMII0_MDIO_1        (PIN_ALT4   | PIN_PORTB | PIN0)
#  define PIN_RMII0_MDIO_2        (PIN_ALT5   | PIN_PORTA | PIN7)
#endif
#define PIN_RMII0_RXD0            (PIN_ALT4   | PIN_PORTA | PIN13)
#define PIN_RMII0_RXD1            (PIN_ALT4   | PIN_PORTA | PIN12)
#ifdef CONFIG_KINETIS_ENET_NORXER
#  define PIN_RMII0_RXER          (GPIO_PULLDOWN | PIN_PORTA | PIN5)
#else
#  define PIN_RMII0_RXER          (PIN_ALT4   | PIN_PORTA | PIN5)
#endif
#define PIN_RMII0_TXD0            (PIN_ALT4   | PIN_PORTA | PIN16)
#define PIN_RMII0_TXD1            (PIN_ALT4   | PIN_PORTA | PIN17)
#define PIN_RMII0_TXEN            (PIN_ALT4   | PIN_PORTA | PIN15)

/* Real-Time Clock (RTC) */

#define PIN_RTC_CLKOUT_1          (PIN_ALT6   | PIN_PORTE | PIN26)
#define PIN_RTC_CLKOUT_2          (PIN_ALT7   | PIN_PORTE | PIN0)

/* Synchronous DRAM Controller Module (SDRAM) */

#define PIN_SDRAM_CAS_B           (PIN_ALT5   | PIN_PORTB | PIN0)
#define PIN_SDRAM_RAS_B           (PIN_ALT5   | PIN_PORTB | PIN1)
#define PIN_SDRAM_WE              (PIN_ALT5   | PIN_PORTB | PIN2)
#define PIN_SDRAM_CKE             (PIN_ALT5   | PIN_PORTD | PIN7)
#define PIN_SDRAM_CS0_B           (PIN_ALT5   | PIN_PORTB | PIN3)
#define PIN_SDRAM_CS1_B           (PIN_ALT5   | PIN_PORTB | PIN4)
#define PIN_SDRAM_D16             (PIN_ALT5   | PIN_PORTB | PIN17)
#define PIN_SDRAM_D17             (PIN_ALT5   | PIN_PORTB | PIN16)
#define PIN_SDRAM_D18             (PIN_ALT5   | PIN_PORTB | PIN11)
#define PIN_SDRAM_D19             (PIN_ALT5   | PIN_PORTB | PIN10)
#define PIN_SDRAM_D20             (PIN_ALT5   | PIN_PORTB | PIN9)
#define PIN_SDRAM_D21             (PIN_ALT5   | PIN_PORTB | PIN8)
#define PIN_SDRAM_D22             (PIN_ALT5   | PIN_PORTB | PIN7)
#define PIN_SDRAM_D23             (PIN_ALT5   | PIN_PORTB | PIN6)
#define PIN_SDRAM_D24             (PIN_ALT5   | PIN_PORTC | PIN15)
#define PIN_SDRAM_D25             (PIN_ALT5   | PIN_PORTC | PIN14)
#define PIN_SDRAM_D26             (PIN_ALT5   | PIN_PORTC | PIN13)
#define PIN_SDRAM_D27             (PIN_ALT5   | PIN_PORTC | PIN12)
#define PIN_SDRAM_D28             (PIN_ALT5   | PIN_PORTB | PIN23)
#define PIN_SDRAM_D29             (PIN_ALT5   | PIN_PORTB | PIN22)
#define PIN_SDRAM_D30             (PIN_ALT5   | PIN_PORTB | PIN21)
#define PIN_SDRAM_D31             (PIN_ALT5   | PIN_PORTB | PIN20)

#define PIN_SDRAM_DQM0            (PIN_ALT5   | PIN_PORTC | PIN19)
#define PIN_SDRAM_DQM1            (PIN_ALT5   | PIN_PORTC | PIN18)
#define PIN_SDRAM_DQM2            (PIN_ALT5   | PIN_PORTC | PIN16)
#define PIN_SDRAM_DQM3            (PIN_ALT5   | PIN_PORTC | PIN17)

#define PIN_SDRAM_A9              (PIN_ALT5   | PIN_PORTD | PIN5)
#define PIN_SDRAM_A10             (PIN_ALT5   | PIN_PORTD | PIN4)
#define PIN_SDRAM_A11             (PIN_ALT5   | PIN_PORTD | PIN3)
#define PIN_SDRAM_A12             (PIN_ALT5   | PIN_PORTD | PIN2)
#define PIN_SDRAM_A13             (PIN_ALT5   | PIN_PORTC | PIN10)
#define PIN_SDRAM_A14             (PIN_ALT5   | PIN_PORTC | PIN9)
#define PIN_SDRAM_A15             (PIN_ALT5   | PIN_PORTC | PIN8)
#define PIN_SDRAM_A16             (PIN_ALT5   | PIN_PORTC | PIN7)
#define PIN_SDRAM_A17             (PIN_ALT5   | PIN_PORTC | PIN6)
#define PIN_SDRAM_A18             (PIN_ALT5   | PIN_PORTC | PIN5)
#define PIN_SDRAM_A19             (PIN_ALT5   | PIN_PORTC | PIN4)
#define PIN_SDRAM_A20             (PIN_ALT5   | PIN_PORTC | PIN2)
#define PIN_SDRAM_A21             (PIN_ALT5   | PIN_PORTC | PIN1)
#define PIN_SDRAM_A22             (PIN_ALT5   | PIN_PORTC | PIN0)
#define PIN_SDRAM_A23             (PIN_ALT5   | PIN_PORTB | PIN18)

/* Secured digital host controller (SDHC) */

#define PIN_SDHC0_CLKIN           (PIN_ALT4   | PIN_PORTD | PIN11)
#define PIN_SDHC0_CMD             (PIN_ALT4   | PIN_PORTE | PIN3)
#define PIN_SDHC0_D0              (PIN_ALT4   | PIN_PORTE | PIN1)
#define PIN_SDHC0_D1              (PIN_ALT4   | PIN_PORTE | PIN0)
#define PIN_SDHC0_D2              (PIN_ALT4   | PIN_PORTE | PIN5)
#define PIN_SDHC0_D3              (PIN_ALT4   | PIN_PORTE | PIN4)
#define PIN_SDHC0_D4              (PIN_ALT4   | PIN_PORTD | PIN12)
#define PIN_SDHC0_D5              (PIN_ALT4   | PIN_PORTD | PIN13)
#define PIN_SDHC0_D6              (PIN_ALT4   | PIN_PORTD | PIN14)
#define PIN_SDHC0_D7              (PIN_ALT4   | PIN_PORTD | PIN15)
#define PIN_SDHC0_DCLK            (PIN_ALT4   | PIN_PORTE | PIN2)

/* SPI */

#define PIN_SPI0_PCS0_1           (PIN_ALT2   | PIN_PORTA | PIN14)
#define PIN_SPI0_PCS0_2           (PIN_ALT2   | PIN_PORTC | PIN4)
#define PIN_SPI0_PCS0_3           (PIN_ALT2   | PIN_PORTD | PIN0)
#define PIN_SPI0_PCS1_1           (PIN_ALT2   | PIN_PORTC | PIN3)
#define PIN_SPI0_PCS1_2           (PIN_ALT2   | PIN_PORTD | PIN4)
#define PIN_SPI0_PCS2_1           (PIN_ALT2   | PIN_PORTC | PIN2)
#define PIN_SPI0_PCS2_3           (PIN_ALT2   | PIN_PORTD | PIN5)
#define PIN_SPI0_PCS3_1           (PIN_ALT2   | PIN_PORTC | PIN1)
#define PIN_SPI0_PCS3_2           (PIN_ALT2   | PIN_PORTD | PIN6)
#define PIN_SPI0_PCS4             (PIN_ALT2   | PIN_PORTC | PIN0)
#define PIN_SPI0_PCS5             (PIN_ALT3   | PIN_PORTB | PIN23)
#define PIN_SPI0_SCK_1            (PIN_ALT2   | PIN_PORTA | PIN15)
#define PIN_SPI0_SCK_2            (PIN_ALT2   | PIN_PORTC | PIN5)
#define PIN_SPI0_SCK_3            (PIN_ALT2   | PIN_PORTD | PIN1)
#define PIN_SPI0_SIN_1            (PIN_ALT2   | PIN_PORTA | PIN17)
#define PIN_SPI0_SIN_2            (PIN_ALT2   | PIN_PORTC | PIN7)
#define PIN_SPI0_SIN_3            (PIN_ALT2   | PIN_PORTD | PIN3)
#define PIN_SPI0_SOUT_1           (PIN_ALT2   | PIN_PORTA | PIN16)
#define PIN_SPI0_SOUT_2           (PIN_ALT2   | PIN_PORTC | PIN6)
#define PIN_SPI0_SOUT_3           (PIN_ALT2   | PIN_PORTD | PIN2)

#define PIN_SPI1_PCS0_1           (PIN_ALT2   | PIN_PORTB | PIN10)
#define PIN_SPI1_PCS0_2           (PIN_ALT2   | PIN_PORTE | PIN4)
#define PIN_SPI1_PCS0_3           (PIN_ALT7   | PIN_PORTD | PIN4)
#define PIN_SPI1_PCS1_1           (PIN_ALT2   | PIN_PORTB | PIN9)
#define PIN_SPI1_PCS1_2           (PIN_ALT2   | PIN_PORTE | PIN0)
#define PIN_SPI1_PCS2             (PIN_ALT2   | PIN_PORTE | PIN5)
#define PIN_SPI1_PCS3             (PIN_ALT2   | PIN_PORTE | PIN6)
#define PIN_SPI1_SCK_1            (PIN_ALT2   | PIN_PORTB | PIN11)
#define PIN_SPI1_SCK_2            (PIN_ALT2   | PIN_PORTE | PIN2)
#define PIN_SPI1_SCK_3            (PIN_ALT7   | PIN_PORTD | PIN5)
#define PIN_SPI1_SIN_1            (PIN_ALT2   | PIN_PORTB | PIN17)
#define PIN_SPI1_SIN_2            (PIN_ALT2   | PIN_PORTE | PIN3)
#define PIN_SPI1_SIN_3            (PIN_ALT7   | PIN_PORTD | PIN7)
#define PIN_SPI1_SIN_4            (PIN_ALT7   | PIN_PORTE | PIN1)
#define PIN_SPI1_SOUT_1           (PIN_ALT2   | PIN_PORTB | PIN16)
#define PIN_SPI1_SOUT_2           (PIN_ALT2   | PIN_PORTE | PIN1)
#define PIN_SPI1_SOUT_3           (PIN_ALT7   | PIN_PORTD | PIN6)
#define PIN_SPI1_SOUT_4           (PIN_ALT7   | PIN_PORTE | PIN3)

#define PIN_SPI2_PCS0_1           (PIN_ALT2   | PIN_PORTB | PIN20)
#define PIN_SPI2_PCS0_2           (PIN_ALT2   | PIN_PORTD | PIN11)
#define PIN_SPI2_PCS1             (PIN_ALT2   | PIN_PORTD | PIN15)
#define PIN_SPI2_SCK_1            (PIN_ALT2   | PIN_PORTB | PIN21)
#define PIN_SPI2_SCK_2            (PIN_ALT2   | PIN_PORTD | PIN12)
#define PIN_SPI2_SIN_1            (PIN_ALT2   | PIN_PORTB | PIN23)
#define PIN_SPI2_SIN_2            (PIN_ALT2   | PIN_PORTD | PIN14)
#define PIN_SPI2_SOUT_1           (PIN_ALT2   | PIN_PORTB | PIN22)
#define PIN_SPI2_SOUT_2           (PIN_ALT2   | PIN_PORTD | PIN13)

/* SWD */

#define PIN_SWD_CLK               (PIN_ALT7   | PIN_PORTA | PIN0)
#define PIN_SWD_DIO               (PIN_ALT7   | PIN_PORTA | PIN3)

/* Timer/PWM Module (TPM) */

#define PIN_TPM1_CH0_1            (PIN_ALT6   | PIN_PORTA | PIN8)
#define PIN_TPM1_CH0_2            (PIN_ALT7   | PIN_PORTA | PIN12)
#define PIN_TPM1_CH0_3            (PIN_ALT6   | PIN_PORTB | PIN0)
#define PIN_TPM1_CH1_1            (PIN_ALT6   | PIN_PORTA | PIN9)
#define PIN_TPM1_CH1_2            (PIN_ALT7   | PIN_PORTA | PIN13)
#define PIN_TPM1_CH1_3            (PIN_ALT6   | PIN_PORTB | PIN1)
#define PIN_TPM2_CH0_1            (PIN_ALT6   | PIN_PORTA | PIN10)
#define PIN_TPM2_CH0_2            (PIN_ALT6   | PIN_PORTB | PIN18)
#define PIN_TPM2_CH1_1            (PIN_ALT6   | PIN_PORTA | PIN11)
#define PIN_TPM2_CH1_2            (PIN_ALT6   | PIN_PORTB | PIN19)

#define PIN_TPM_CLKIN0_1          (PIN_ALT7   | PIN_PORTA | PIN18)
#define PIN_TPM_CLKIN0_2          (PIN_ALT7   | PIN_PORTB | PIN16)
#define PIN_TPM_CLKIN0_3          (PIN_ALT7   | PIN_PORTC | PIN12)
#define PIN_TPM_CLKIN1_1          (PIN_ALT7   | PIN_PORTA | PIN17)
#define PIN_TPM_CLKIN1_2          (PIN_ALT7   | PIN_PORTB | PIN17)
#define PIN_TPM_CLKIN1_3          (PIN_ALT7   | PIN_PORTC | PIN13)

/* Touch Sensing Input (TSI) */

#define PIN_TSI0_CH0_1            (PIN_ANALOG   | PIN_PORTB | PIN0)
#define PIN_TSI0_CH1_1            (PIN_ANALOG   | PIN_PORTA | PIN0)
#define PIN_TSI0_CH2_1            (PIN_ANALOG   | PIN_PORTA | PIN1)
#define PIN_TSI0_CH3_1            (PIN_ANALOG   | PIN_PORTA | PIN2)
#define PIN_TSI0_CH4_1            (PIN_ANALOG   | PIN_PORTA | PIN3)
#define PIN_TSI0_CH5_1            (PIN_ANALOG   | PIN_PORTA | PIN4)
#define PIN_TSI0_CH6_1            (PIN_ANALOG   | PIN_PORTB | PIN1)
#define PIN_TSI0_CH7_1            (PIN_ANALOG   | PIN_PORTB | PIN2)
#define PIN_TSI0_CH8_1            (PIN_ANALOG   | PIN_PORTB | PIN3)
#define PIN_TSI0_CH9_1            (PIN_ANALOG   | PIN_PORTB | PIN16)
#define PIN_TSI0_CH10_1           (PIN_ANALOG   | PIN_PORTB | PIN17)
#define PIN_TSI0_CH11_1           (PIN_ANALOG   | PIN_PORTB | PIN18)
#define PIN_TSI0_CH12_1           (PIN_ANALOG   | PIN_PORTB | PIN19)
#define PIN_TSI0_CH13_1           (PIN_ANALOG   | PIN_PORTC | PIN0)
#define PIN_TSI0_CH14_1           (PIN_ANALOG   | PIN_PORTC | PIN1)
#define PIN_TSI0_CH15_1           (PIN_ANALOG   | PIN_PORTC | PIN2)

/* Trace */

#define PIN_TRACE_CLKOUT_1        (PIN_ALT5   | PIN_PORTE | PIN0)
#define PIN_TRACE_CLKOUT_2        (PIN_ALT7   | PIN_PORTA | PIN6)
#define PIN_TRACE_D0_1            (PIN_ALT5   | PIN_PORTE | PIN4)
#define PIN_TRACE_D0_2            (PIN_ALT7   | PIN_PORTA | PIN10)
#define PIN_TRACE_D1_1            (PIN_ALT5   | PIN_PORTE | PIN3)
#define PIN_TRACE_D1_2            (PIN_ALT7   | PIN_PORTA | PIN9)
#define PIN_TRACE_D2_1            (PIN_ALT5   | PIN_PORTE | PIN2)
#define PIN_TRACE_D2_2            (PIN_ALT7   | PIN_PORTA | PIN8)
#define PIN_TRACE_D3_1            (PIN_ALT5   | PIN_PORTE | PIN1)
#define PIN_TRACE_D3_2            (PIN_ALT7   | PIN_PORTA | PIN7)
#define PIN_TRACE_SWO             (PIN_ALT7   | PIN_PORTA | PIN2)

